<template>
  <Dialog :value="show" title="活动规则说明" @input="e => $emit('input', e)" class="common-dialog ModalRules">
    <div class="content" >
      <h2>一、具体规则</h2>
      <!-- <h3>(1）邀请新用户购买返佣奖励</h3> -->
      <p>
        用户(以下称"用户"或"您"”)每通过邀请注册页或者活动页邀请一位新用户(“新用户"指从未注册且从未下载过"建考"App的用户，是否为新用户以广新纳判定为准)注册"建考"App(亦称"建考App"或"App")，都可获得此新用户之后在建考APP内购买科目金额的5%返佣。
      </p>
      <h2>二、其他注意事项</h2>
      <p>
        (1)通过激活码激活科目不计算返佣，购买后退货，如已返佣，将从退还金额扣除返佣。
      </p>
      <p>
        (2)返佣页面金额显示可能会有延迟，您可耐心等待，如长时间未显示或更新奖励，您可咨询客服查询返佣情况。
      </p>
      <p>
        (3)若用户的账号处于异常状态，则可能无法参与本次活动。账号异常状态包括但不限于:未绑定手机号码，账号冻结、账号封禁等状态，有关账号异常状态的详细情形等信息请咨询在线客服。
      </p>
      <p>
        (4)本活动仅支持使用中国电信、中国联通、中国移动手机号绑定的建考账号。以虚拟运营商手机号注册的建考帐号无法参与本次活动。
      </p>
      <p>
        (5)如发现用户存在任何违规套取佣金的行为，包括且不限于虚假交易、批量注册、用机器注册账户、机器模拟客户端、提供虚假信息、未真实购买或以不正当手段及舞弊行为等方式参与本次活动,广新纳将视情节严重程度按照相关规则对用户进行处罚。包括但不限于不予发放佣金,不与提现佣金，封停邀请返佣功能,冻结所有通过邀请返佣渠道获得的佣金，依法追究其法律责任等；如返佣金额已经提现或使用，广新纳有权收回。
      </p>
      <p>
        (6)建考会使用包括但不限于第三方技术手段审核用户的参与活动行为，如发现账号违规、异常等非正常情况，建考有权立即取消您的活动参与资格与领奖资格;如奖励已经发放,建考有权收回。
      </p>
      <p>
        (7)为了保证活动可持续发展，请用户合理参与活动，避免滥发推广、扰乱公共秩序,未经广新纳授权不得以广新纳或者建考名义或者使用建考APP进行任何形式的推广。
      </p>
      <p>
        (8)在法律法规许可的范围内，“广新纳”可根据其业务开展或技术升级等情况变更或修改本规则，并在“建考APP”相关页面上公示修改的内容。
      </p>
      <p>
        (9)活动期间，因用户操作不当或用户所在地区网络故障、电信运营商故障等非广新纳所能控制的原因导致用户无法参与活动或参与失败，建考不承担任何责任,请您联系当地电信运营商解决。
      </p>
      <p>
        (10)活动期间如出现不可抗力或情势变更的情况（包括但不限于重大灾害事件、活动受政府机关指令需要停止举办或调整的、活动遭受严重网络攻击或因系统故障需要暂停举办的），广新纳可依相关法律法规的规定主张免责.
      </p>
      <p>
        (11)本活动长期有效，但广新纳有权视活动开展情况随时终止本活动，如本活动被终止，不影响您已获得(含尚未发放的部分)的返佣提现或抵扣使用。注:本活动规则自发布日生效。
      </p>
      <p>
        (12)本次活动与Apple.Inc无关。
      </p>
    </div>
  </Dialog>
</template>

<script>
import { Dialog } from 'vant'

export default {
  components: { Dialog: Dialog.Component },
  props: {
    show: Boolean,
  },
}
</script>

<style lang="less">
.ModalRules {
  &.van-dialog {
    top: 50%;
  }
  .content {
    height: calc(100vh - 300px);
    overflow-y: auto;
    margin: 10px 0 0 0;
    padding: 0 15px 10px 15px;
  }
}
</style>

