<template>
  <Dialog :value="show" :showConfirmButton="false" title="活动规则" @input="e => $emit('input', e)" class="common-dialog ActivityModal ModalRules">
    <div class="content">
      <h2>抽奖活动规则说明：</h2>
      <p>1.新用户购买过科目后将自动获取参与活动资格.</p>
      <p>2.已购买过科目的老用户在活动页面参与活动后即可获得活动资格。（活动资格可在活动页面查询）。</p>
      <p>3.参与活动自动获得一张抽奖券。</p>
      <p>4.邀请好友助力、注册、登录建考APP、购买科目，都可获得额外抽奖券，增加用户中奖几率。</p>
      <p>5.邀请好友助力共分三个档次，当邀请数别达到3人、8人、20人后各获得1张抽奖券，总共最多获得3张。一个微信号只能给一个用户助力1次，总共可为3个好友助力，不可以为自己助力。</p>
      <p>6.每邀请1位新用户在活动页面注册成功可获得1张抽奖券，最多可通过此方式获得8张抽奖券。</p>
      <p>7.每邀请1位新用户在活动页面注册并登录了建考APP，可获得2张抽奖券，最多可通过此方式获得16张抽奖券。</p>
      <p>8.若邀请的用户购买科目或自己购买科目即可获得3张抽奖券，通过此方式获得的抽奖券数无上限限制。</p>
      <p>9.通过激活码激活的科目，不在此次活动范围内。</p>
      <p>10.本活动仅限于符合活动规则的用户参与，每个用户在活动期间仅限使用一个账号参与活动，如广新纳通过技术手段检测到其他账号邀请行为可归属于您本人的，则广新纳有权取消其他账号的参与活动资格及领奖资格；如奖励已经发放，广新纳有权收回。</p>
      <p>11.若用户的账号处于异常状态，则可能无法参与本次活动。账号的异常状态包括但不限于：未绑定手机号码，账号冻结，账号封禁等状态，有关账号异常状态的详细信息请咨询客服。</p>
      <p>12.任何参与活动的用户不得修改活动页面参数，或以任何机器人软件、蜘蛛软件、爬虫软件、刷屏软件等任何非人工、舞弊或其他不正当方式参与活动，一经发现，广新纳有权立即取消您的活动参与资格与领取奖励资格；如奖励已经发放，广新纳有权收回。</p>
      <p>13.活动期间，因用户操作不当或用户所在地区网络故障、电信运营商故障等非广新纳所能控制的原因导致用户无法参与活动或参与失败，广新纳不承担任何责任，请您联系当地电信运营商解决。</p>
      <p>14.活动结束时间为2021年5月31日12：00。抽奖结果公示时间为 2021年6月1日12：00 ，广新纳有权视活动的开展情况随时终止本活动，如活动被终止，不影响您已确定获得的奖励发放。</p>
      <p>15.活动主办方有权在法律允许的范围内对本次活动予以解释，活动规则自发布日生效。</p>
      <p>16.本次活动与Apple.Inc无关。</p>

      <h2>奖品说明：</h2>
      <h3>一等奖：旅游卡</h3>
      <p>旅游年卡有效期为1年，可选择1年内任意时间参与旅游活动。（这里再跟旅游卡介绍）</p>
      <h3>二等奖：考试科目书籍</h3>
      <p>任意一个科目的考试用书一套，只能兑换一次，兑换有效期为1年。</p>
      <h3>三等奖：科目激活码</h3>
      <p>任意一个科目的科目激活码，可激活科目一年，兑换有效期1年。</p>
    </div>
    <div class="close-btn" @click="$emit('input', false)"></div>
  </Dialog>
</template>

<script>
import { Icon, Dialog } from 'vant'

export default {
  components: { Icon, Dialog: Dialog.Component },
  props: {
    show: Boolean,
  },
  data() {
    return {

    }
  },
}
</script>

<style lang="less">
@import url(./styles/modal.less);
.ModalRules {
  h2, h3 {
    font-weight: bold;
  }
  h2 {
    margin: 20px 0;
  }
  h3 {
    margin: 10px 0;
  }
  .content {
    overflow-y: auto;
    max-height: 80vh;
  }
}
</style>

